Repository: chrisnguyen1211/pillrdotlol
Catalog: Sources/LidEffort/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, pt_br, ru, zh_hans

source: API key (per token)
fr: Clé API (par token)
ja: API キー（トークン単位）
pt_br: Chave de API (por token)
ru: API-ключ (за токены)
zh_hans: API 密钥（按 token）

source: Active time
fr: Temps actif
ja: 稼働時間
pt_br: Tempo ativo
ru: Активное время
zh_hans: 活跃时长

source: Activity
fr: Activité
ja: アクティビティ
pt_br: Atividade
ru: Активность
zh_hans: 使用记录

source: All
fr: Tout
ja: すべて
pt_br: Tudo
ru: Всё
zh_hans: 全部

source: All accounts
fr: Tous les comptes
ja: すべてのアカウント
pt_br: Todas as contas
ru: Все аккаунты
zh_hans: 全部账号

source: All time
fr: Depuis toujours
ja: 全期間
pt_br: Todo o período
ru: За всё время
zh_hans: 全部时间

source: Billing
fr: Facturation
ja: 支払い方法
pt_br: Cobrança
ru: Оплата
zh_hans: 计费

source: Costs
fr: Coûts
ja: コスト
pt_br: Custos
ru: Расходы
zh_hans: 费用

source: Day
fr: Jour
ja: 日
pt_br: Dia
ru: День
zh_hans: 日

source: Day, week and month per login: sessions per project with what each cost.
fr: Jour, semaine et mois par compte : les sessions par projet et ce que chacune a coûté.
ja: ログインごとの日・週・月：プロジェクト別のセッションとそれぞれのコスト。
pt_br: Dia, semana e mês por login: sessões por projeto com o custo de cada uma.
ru: День, неделя и месяц для каждого входа: сеансы по проектам и стоимость каждого.
zh_hans: 按每个登录看日、周、月：每个项目的会话，以及各自花了多少。

source: Detected from each login once a day. A week of the plan costs the price ÷ 4.35; a project that used 4%% of the weekly allowance spent 4%% of that. Amounts in %@, your Mac's currency. Type the amount you actually pay to override the list price.
fr: Détecté une fois par jour depuis chaque compte. Une semaine du forfait coûte le prix ÷ 4,35 ; un projet qui a utilisé 4 %% du quota hebdomadaire en a dépensé 4 %%. Montants en %@, la devise de votre Mac. Saisissez ce que vous payez réellement pour remplacer le prix catalogue.
ja: 各ログインから1日1回検出します。プランの1週間分は価格 ÷ 4.35 で、週間上限の4%%を使ったプロジェクトはその4%%を使ったことになります。金額はこのMacの通貨（%@）で表示します。実際に支払っている金額を入力すると定価の代わりに使われます。
pt_br: Detectado em cada login uma vez por dia. Uma semana do plano custa o preço ÷ 4,35; um projeto que usou 4%% da cota semanal gastou 4%% disso. Valores em %@, a moeda do seu Mac. Digite o valor que você realmente paga para substituir o preço de tabela.
ru: Определяется для каждого входа раз в день. Неделя тарифа стоит цену ÷ 4,35; проект, использовавший 4%% недельного лимита, потратил 4%% от неё. Суммы в валюте вашего Mac: %@. Введите сумму, которую вы действительно платите, чтобы заменить цену из прайса.
zh_hans: 每天从各个登录检测一次。套餐一周的费用 = 价格 ÷ 4.35；某项目用了每周额度的 4%%，就花了其中的 4%%。金额以 %@（本机货币）显示。输入你实际支付的金额即可替代标价。

source: Download exchange rate and token prices
fr: Télécharger le taux de change et les prix par token
ja: 為替レートとトークン単価をダウンロード
pt_br: Baixar câmbio e preços por token
ru: Загружать курс валют и цены за токены
zh_hans: 下载汇率和 token 价格

source: Elsewhere
fr: Ailleurs
ja: その他の場所
pt_br: Outros
ru: В другом месте
zh_hans: 其他地方

source: Estimated cost
fr: Coût estimé
ja: 推定コスト
pt_br: Custo estimado
ru: Оценка стоимости
zh_hans: 估算费用

source: Estimated cost per day; hover a bar for active time
fr: Coût estimé par jour ; survolez une barre pour le temps actif
ja: 1日あたりの推定コスト。バーにポインタを置くと稼働時間を表示
pt_br: Custo estimado por dia; passe o cursor numa barra para ver o tempo ativo
ru: Оценка стоимости за день; наведите на столбец, чтобы увидеть активное время
zh_hans: 每日估算费用；悬停柱形可看活跃时长

source: Exchange rate
fr: Taux de change
ja: 為替レート
pt_br: Câmbio
ru: Курс валют
zh_hans: 汇率

source: How the money is worked out
fr: Comment le montant est calculé
ja: 金額の算出方法
pt_br: Como o valor é calculado
ru: Как считаются суммы
zh_hans: 这笔钱怎么算出来

source: Loading…
fr: Chargement…
ja: 読み込み中…
pt_br: Carregando…
ru: Загрузка…
zh_hans: 正在加载…

source: Market data
fr: Données de marché
ja: 市場データ
pt_br: Dados de mercado
ru: Рыночные данные
zh_hans: 市场数据

source: Month
fr: Mois
ja: 月
pt_br: Mês
ru: Месяц
zh_hans: 月

source: Monthly plan
fr: Forfait mensuel
ja: 月額プラン
pt_br: Plano mensal
ru: Ежемесячный тариф
zh_hans: 月付方案

source: Monthly price
fr: Prix mensuel
ja: 月額料金
pt_br: Preço mensal
ru: Цена в месяц
zh_hans: 每月价格

source: No Claude Code or Codex login on this Mac yet.
fr: Aucun compte Claude Code ou Codex sur ce Mac pour l'instant.
ja: このMacにはまだ Claude Code または Codex のログインがありません。
pt_br: Ainda não há login do Claude Code ou do Codex neste Mac.
ru: На этом Mac пока нет входа в Claude Code или Codex.
zh_hans: 这台 Mac 上还没有 Claude Code 或 Codex 登录。

source: No sessions on this day
fr: Aucune session ce jour-là
ja: この日のセッションはありません
pt_br: Nenhuma sessão neste dia
ru: В этот день сеансов нет
zh_hans: 这一天没有会话

source: Not fetched yet
fr: Pas encore récupéré
ja: 未取得
pt_br: Ainda não obtido
ru: Ещё не загружено
zh_hans: 尚未获取

source: Open Activity…
fr: Ouvrir l'activité…
ja: アクティビティを開く…
pt_br: Abrir Atividade…
ru: Открыть активность…
zh_hans: 打开使用记录…

source: Open catalog
fr: Ouvrir le catalogue
ja: カタログを開く
pt_br: Abrir catálogo
ru: Открыть каталог
zh_hans: 打开目录

source: Other (%lld)
fr: Autres (%lld)
ja: その他（%lld）
pt_br: Outros (%lld)
ru: Другие (%lld)
zh_hans: 其他（%lld）

source: Per-token prices
fr: Prix par token
ja: トークン単価
pt_br: Preços por token
ru: Цены за токены
zh_hans: 按 token 的价格

source: Plan
fr: Forfait
ja: プラン
pt_br: Plano
ru: Тариф
zh_hans: 方案

source: Plan catalog
fr: Catalogue des forfaits
ja: プランカタログ
pt_br: Catálogo de planos
ru: Каталог тарифов
zh_hans: 方案目录

source: Plan not detected yet
fr: Forfait pas encore détecté
ja: プランはまだ検出されていません
pt_br: Plano ainda não detectado
ru: Тариф ещё не определён
zh_hans: 尚未识别方案

source: This month
fr: Ce mois-ci
ja: 今月
pt_br: Este mês
ru: В этом месяце
zh_hans: 本月

source: This session
fr: Cette session
ja: このセッション
pt_br: Esta sessão
ru: Этот сеанс
zh_hans: 本次会话

source: This week
fr: Cette semaine
ja: 今週
pt_br: Esta semana
ru: На этой неделе
zh_hans: 本周

source: Turns
fr: Tours
ja: ターン
pt_br: Turnos
ru: Ходы
zh_hans: 回合

source: Turns are read from the transcripts each account writes; the first ones show up a few minutes after a session starts.
fr: Les tours sont lus dans les transcriptions écrites par chaque compte ; les premiers apparaissent quelques minutes après le début d'une session.
ja: ターンは各アカウントが書き出すトランスクリプトから読み取ります。最初のターンはセッション開始の数分後に表示されます。
pt_br: Os turnos são lidos das transcrições que cada conta grava; os primeiros aparecem alguns minutos depois do início da sessão.
ru: Ходы читаются из журналов, которые пишет каждый аккаунт; первые появляются через несколько минут после начала сеанса.
zh_hans: 回合从每个账号写下的记录里读取；会话开始几分钟后，头几条就会出现。

source: Week
fr: Semaine
ja: 週
pt_br: Semana
ru: Неделя
zh_hans: 周

source: What each project spent of each login's allowance, priced from your plan.
fr: Ce que chaque projet a dépensé du quota de chaque compte, valorisé selon votre forfait.
ja: 各ログインの利用枠のうち、各プロジェクトが使った分を、プランの価格で表示します。
pt_br: Quanto cada projeto gastou da cota de cada login, com preço do seu plano.
ru: Сколько каждый проект потратил из лимита каждого входа — в деньгах по вашему тарифу.
zh_hans: 各项目用掉了每个登录额度的多少，按你的套餐计价。

source: Sign in to QianwenAI to read your Token Plan usage
fr: Connectez-vous à QianwenAI pour lire l'utilisation de votre Token Plan
ja: Token Plan の使用量を読み取るには QianwenAI にサインインしてください
pt_br: Entre no QianwenAI para ler o uso do seu Token Plan
ru: Войдите в QianwenAI, чтобы видеть расход Token Plan
zh_hans: 登录 QianwenAI 以读取 Token Plan 用量

source: Custom Endpoints
fr: Points de terminaison personnalisés
ja: カスタムエンドポイント
pt_br: Endpoints personalizados
ru: Свои эндпоинты
zh_hans: 自定义端点

source: Most readings are borrowed from a tool that already holds the account. DeepSeek, MiniMax and QianwenAI are the exceptions: clicking Sign in opens a pillr window for that account, and signing out here clears only that session and its saved reading.
fr: La plupart des relevés sont empruntés à un outil qui détient déjà le compte. DeepSeek, MiniMax et QianwenAI font exception : cliquer sur Se connecter ouvre une fenêtre pillr pour ce compte, et se déconnecter ici efface uniquement cette session et son relevé enregistré.
ja: ほとんどの数値は、すでにアカウントを持っているツールから借りています。DeepSeek、MiniMax、QianwenAI は例外です。サインインをクリックするとそのアカウント用の pillr ウインドウが開き、ここでサインアウトすると、そのセッションと保存された数値だけが消去されます。
pt_br: A maioria das leituras vem de uma ferramenta que já tem a conta. DeepSeek, MiniMax e QianwenAI são as exceções: clicar em Entrar abre uma janela do pillr para essa conta, e sair aqui apaga apenas essa sessão e a leitura salva.
ru: Большинство показаний берётся у инструмента, в котором уже есть учётная запись. Исключения — DeepSeek, MiniMax и QianwenAI: кнопка «Войти» открывает окно pillr для этой учётной записи, а выход здесь стирает только эту сессию и её сохранённое показание.
zh_hans: 大多数读数借自已经持有账号的工具。DeepSeek、MiniMax 和 QianwenAI 是例外：点「登录」会为该账号打开一个 pillr 窗口，在这里退出只会清除该会话及其保存的读数。

source: Region
fr: Région
ja: 地域
pt_br: Região
ru: Регион
zh_hans: 地区

source: China mainland
fr: Chine continentale
ja: 中国本土
pt_br: China continental
ru: Материковый Китай
zh_hans: 中国大陆

source: Sign in to MiniMax in pillr, or paste a Coding Plan key. A Cookie header is optional. pillr never reads a browser's cookies.
fr: Connectez-vous à MiniMax dans pillr, ou collez une clé Coding Plan. Un en-tête Cookie est facultatif. pillr ne lit jamais les cookies d'un navigateur.
ja: pillr で MiniMax にサインインするか、Coding Plan のキーを貼り付けてください。Cookie ヘッダーは任意です。pillr がブラウザの Cookie を読むことはありません。
pt_br: Entre no MiniMax pelo pillr ou cole uma chave do Coding Plan. Um cabeçalho Cookie é opcional. O pillr nunca lê os cookies de um navegador.
ru: Войдите в MiniMax в pillr или вставьте ключ Coding Plan. Заголовок Cookie необязателен. pillr никогда не читает cookie браузера.
zh_hans: 在 pillr 中登录 MiniMax，或粘贴 Coding Plan 密钥。Cookie 请求头可选。pillr 从不读取浏览器的 Cookie。

source: MiniMax Coding Plan key
fr: Clé MiniMax Coding Plan
ja: MiniMax Coding Plan のキー
pt_br: Chave do MiniMax Coding Plan
ru: Ключ MiniMax Coding Plan
zh_hans: MiniMax Coding Plan 密钥

source: Cookie header (optional)
fr: En-tête Cookie (facultatif)
ja: Cookie ヘッダー（任意）
pt_br: Cabeçalho Cookie (opcional)
ru: Заголовок Cookie (необязательно)
zh_hans: Cookie 请求头（可选）

source: Online
fr: En ligne
ja: オンライン
ru: В сети
zh_hans: 在线

source: Slow
fr: Lent
ja: 遅い
pt_br: Lento
ru: Медленно
zh_hans: 较慢

source: Unreachable
fr: Injoignable
ja: 接続できません
pt_br: Inacessível
ru: Недоступен
zh_hans: 无法连接

source: Not Checked
fr: Non vérifié
ja: 未確認
pt_br: Não verificado
ru: Не проверено
zh_hans: 未检查

source: The address must start with http:// or https://
fr: L'adresse doit commencer par http:// ou https://
ja: アドレスは http:// または https:// で始める必要があります
pt_br: O endereço deve começar com http:// ou https://
ru: Адрес должен начинаться с http:// или https://
zh_hans: 地址必须以 http:// 或 https:// 开头

source: Could not build the model-list URL
fr: Impossible de construire l'URL de la liste des modèles
ja: モデル一覧の URL を組み立てられませんでした
pt_br: Não foi possível montar a URL da lista de modelos
ru: Не удалось составить URL списка моделей
zh_hans: 无法构建模型列表 URL

source: Not an HTTP endpoint
fr: Ce n'est pas un point de terminaison HTTP
ja: HTTP エンドポイントではありません
pt_br: Não é um endpoint HTTP
ru: Это не HTTP-эндпоинт
zh_hans: 不是 HTTP 端点

source: The endpoint answered %lld
fr: Le point de terminaison a répondu %lld
ja: エンドポイントが %lld を返しました
pt_br: O endpoint respondeu %lld
ru: Эндпоинт ответил %lld
zh_hans: 端点返回了 %lld

source: The endpoint did not answer in time
fr: Le point de terminaison n'a pas répondu à temps
ja: エンドポイントが時間内に応答しませんでした
pt_br: O endpoint não respondeu a tempo
ru: Эндпоинт не ответил вовремя
zh_hans: 端点没有及时回应

source: Could not reach the endpoint
fr: Impossible de joindre le point de terminaison
ja: エンドポイントに接続できませんでした
pt_br: Não foi possível alcançar o endpoint
ru: Не удалось связаться с эндпоинтом
zh_hans: 无法连接到端点

source: Custom Endpoint
fr: Point de terminaison personnalisé
ja: カスタムエンドポイント
pt_br: Endpoint personalizado
ru: Свой эндпоинт
zh_hans: 自定义端点

source: Configure endpoint details and credentials in Settings.
fr: Configurez les détails et les identifiants du point de terminaison dans les Réglages.
ja: エンドポイントの詳細と認証情報は設定で構成してください。
pt_br: Configure os detalhes e as credenciais do endpoint nos Ajustes.
ru: Настройте параметры эндпоинта и учётные данные в настройках.
zh_hans: 在设置里配置端点详情和凭证。

source: Average generation speed
fr: Vitesse moyenne de génération
ja: 平均生成速度
pt_br: Velocidade média de geração
ru: Средняя скорость генерации
zh_hans: 平均生成速度

source: Active requests
fr: Requêtes actives
ja: 処理中のリクエスト
pt_br: Solicitações ativas
ru: Активные запросы
zh_hans: 进行中的请求

source: Queued requests
fr: Requêtes en attente
ja: 待機中のリクエスト
pt_br: Solicitações na fila
ru: Запросы в очереди
zh_hans: 排队中的请求

source: Tokens Since Server Start
fr: Tokens depuis le démarrage du serveur
ja: サーバー起動以降のトークン
pt_br: Tokens desde o início do servidor
ru: Токены с запуска сервера
zh_hans: 服务器启动以来的 token

source: Quota Used
fr: Quota utilisé
ja: 使用済みクォータ
pt_br: Cota usada
ru: Использовано квоты
zh_hans: 已用配额

source: %@ credits left · %@ monthly + %@ extra
fr: %1$@ crédits restants · %2$@ par mois + %3$@ en plus
ja: 残り %1$@ クレジット · 月 %2$@ + 追加 %3$@
pt_br: %1$@ créditos restantes · %2$@ mensais + %3$@ extras
ru: Осталось %1$@ кредитов · %2$@ в месяц + %3$@ сверх
zh_hans: 剩余 %1$@ 点 · 每月 %2$@ + 额外 %3$@

source: %@ of %@ monthly credits left
fr: %1$@ sur %2$@ crédits mensuels restants
ja: 月 %2$@ クレジットのうち残り %1$@
pt_br: %1$@ de %2$@ créditos mensais restantes
ru: Осталось %1$@ из %2$@ кредитов в месяц
zh_hans: 剩余 %1$@，每月共 %2$@

source: %@ / %@ remaining
fr: %1$@ / %2$@ restants
ja: 残り %1$@ / %2$@
pt_br: %1$@ / %2$@ restantes
ru: Осталось %1$@ / %2$@
zh_hans: 剩余 %1$@ / %2$@

source: Remaining Budget
fr: Budget restant
ja: 残りの予算
pt_br: Orçamento restante
ru: Остаток бюджета
zh_hans: 剩余预算

source: Monthly Budget
fr: Budget mensuel
ja: 月間予算
pt_br: Orçamento mensal
ru: Бюджет на месяц
zh_hans: 每月预算

source: Total Spend
fr: Dépense totale
ja: 総支出
pt_br: Gasto total
ru: Всего потрачено
zh_hans: 总花费

source: %@ / %@ tokens remaining
fr: %1$@ / %2$@ tokens restants
ja: 残り %1$@ / %2$@ トークン
pt_br: %1$@ / %2$@ tokens restantes
ru: Осталось %1$@ / %2$@ токенов
zh_hans: 剩余 %1$@ / %2$@ token

source: %@ / %@ tokens
fr: %1$@ / %2$@ tokens
ja: %1$@ / %2$@ トークン
pt_br: %1$@ / %2$@ tokens
ru: %1$@ / %2$@ токенов
zh_hans: %1$@ / %2$@ token

source: Remaining Tokens
fr: Tokens restants
ja: 残りのトークン
pt_br: Tokens restantes
ru: Осталось токенов
zh_hans: 剩余 token

source: Monthly Tokens
fr: Tokens mensuels
ja: 月間トークン
pt_br: Tokens mensais
ru: Токены за месяц
zh_hans: 每月 token

source: Tokens Used
fr: Tokens utilisés
ja: 使用済みトークン
pt_br: Tokens usados
ru: Использовано токенов
zh_hans: 已用 token

source: China
fr: Chine
ja: 中国
ru: Китай
zh_hans: 中国

source: Paste a Coding Plan key in Settings, or Sign in to MiniMax.
fr: Collez une clé Coding Plan dans les Réglages, ou connectez-vous à MiniMax.
ja: 設定で Coding Plan のキーを貼り付けるか、MiniMax にサインインしてください。
pt_br: Cole uma chave do Coding Plan nos Ajustes ou entre no MiniMax.
ru: Вставьте ключ Coding Plan в настройках или войдите в MiniMax.
zh_hans: 在设置里粘贴 Coding Plan 密钥，或登录 MiniMax。

source: MiniMax reported no usage windows
fr: MiniMax n'a signalé aucune fenêtre d'utilisation
ja: MiniMax は使用量の枠を返しませんでした
pt_br: O MiniMax não informou nenhuma janela de uso
ru: MiniMax не сообщил ни одного окна расхода
zh_hans: MiniMax 没有返回任何用量窗口

source: QianwenAI reported no Token Plan usage
fr: QianwenAI n'a signalé aucune utilisation du Token Plan
ja: QianwenAI から Token Plan の使用量が報告されませんでした
pt_br: O QianwenAI não informou uso do Token Plan
ru: QianwenAI не сообщил расход Token Plan
zh_hans: QianwenAI 未报告 Token Plan 用量

source: QianwenAI refused the request.
fr: QianwenAI a refusé la requête.
ja: QianwenAI がリクエストを拒否しました。
pt_br: O QianwenAI recusou a solicitação.
ru: QianwenAI отклонил запрос.
zh_hans: QianwenAI 拒绝了请求。

source: Connect any OpenAI-compatible API, local inference runtime, or custom proxy.
fr: Connectez n'importe quelle API compatible OpenAI, un moteur d'inférence local ou un proxy personnalisé.
ja: OpenAI 互換の API、ローカル推論ランタイム、独自のプロキシを接続できます。
pt_br: Conecte qualquer API compatível com a OpenAI, runtime de inferência local ou proxy personalizado.
ru: Подключите любой OpenAI-совместимый API, локальную среду инференса или свой прокси.
zh_hans: 连接任何兼容 OpenAI 的 API、本地推理运行时或自定义代理。

source: Add Endpoint
fr: Ajouter un point de terminaison
ja: エンドポイントを追加
pt_br: Adicionar endpoint
ru: Добавить эндпоинт
zh_hans: 添加端点

source: Hide Templates
fr: Masquer les modèles
ja: テンプレートを隠す
pt_br: Ocultar modelos
ru: Скрыть шаблоны
zh_hans: 隐藏模板

source: Quick Templates
fr: Modèles rapides
ja: クイックテンプレート
pt_br: Modelos rápidos
ru: Быстрые шаблоны
zh_hans: 快速模板

source: Scan Local Engines
fr: Rechercher les moteurs locaux
ja: ローカルエンジンを検索
pt_br: Procurar motores locais
ru: Найти локальные движки
zh_hans: 扫描本地引擎

source: Discovered Local Services:
fr: Services locaux trouvés :
ja: 見つかったローカルサービス:
pt_br: Serviços locais encontrados:
ru: Найденные локальные сервисы:
zh_hans: 发现的本地服务：

source: Add to Endpoints
fr: Ajouter aux points de terminaison
ja: エンドポイントに追加
pt_br: Adicionar aos endpoints
ru: Добавить в эндпоинты
zh_hans: 加入端点

source: Choose a preset to pre-fill settings:
fr: Choisissez un préréglage pour pré-remplir les réglages :
ja: 設定を事前入力するプリセットを選んでください:
pt_br: Escolha uma predefinição para preencher os ajustes:
ru: Выберите пресет, чтобы заполнить настройки:
zh_hans: 选一个预设来填好设置：

source: New Custom Endpoint
fr: Nouveau point de terminaison personnalisé
ja: 新しいカスタムエンドポイント
pt_br: Novo endpoint personalizado
ru: Новый свой эндпоинт
zh_hans: 新建自定义端点

source: Edit Endpoint
fr: Modifier le point de terminaison
ja: エンドポイントを編集
pt_br: Editar endpoint
ru: Изменить эндпоинт
zh_hans: 编辑端点

source: No custom endpoints yet. Click 'Add Endpoint' or pick a Quick Template to get started.
fr: Aucun point de terminaison personnalisé pour l'instant. Cliquez sur « Ajouter un point de terminaison » ou choisissez un modèle rapide pour commencer.
ja: カスタムエンドポイントはまだありません。「エンドポイントを追加」をクリックするか、クイックテンプレートを選んで始めましょう。
pt_br: Ainda não há endpoints personalizados. Clique em “Adicionar endpoint” ou escolha um modelo rápido para começar.
ru: Своих эндпоинтов пока нет. Нажмите «Добавить эндпоинт» или выберите быстрый шаблон.
zh_hans: 还没有自定义端点。点「添加端点」，或选一个快速模板开始。

source: Test
fr: Tester
ja: テスト
pt_br: Testar
ru: Проверить
zh_hans: 测试

source: Edit
fr: Modifier
ja: 編集
pt_br: Editar
ru: Изменить
zh_hans: 编辑

source: %@ / %@ left
fr: %1$@ / %2$@ restants
ja: 残り %1$@ / %2$@
pt_br: %1$@ / %2$@ restantes
ru: Осталось %1$@ / %2$@
zh_hans: 剩余 %1$@ / %2$@

source: Spend: $%.2f
fr: Dépense : %.2f $
ja: 支出: $%.2f
pt_br: Gasto: US$ %.2f
ru: Расход: $%.2f
zh_hans: 花费：$%.2f

source: Name
fr: Nom
ja: 名前
pt_br: Nome
ru: Название
zh_hans: 名称

source: e.g. My OpenRouter, Local vLLM
fr: ex. Mon OpenRouter, vLLM local
ja: 例: My OpenRouter、ローカル vLLM
pt_br: ex.: Meu OpenRouter, vLLM local
ru: например, Мой OpenRouter, локальный vLLM
zh_hans: 例如 My OpenRouter、本地 vLLM

source: API type
fr: Type d'API
ja: API の種類
pt_br: Tipo de API
ru: Тип API
zh_hans: API 类型

source: OpenAI-compatible
fr: Compatible OpenAI
ja: OpenAI 互換
pt_br: Compatível com OpenAI
ru: Совместимый с OpenAI
zh_hans: 兼容 OpenAI

source: Base URL
fr: URL de base
ja: ベース URL
pt_br: URL base
ru: Базовый URL
zh_hans: 基础 URL

source: API Key
fr: Clé API
ja: API キー
pt_br: Chave de API
ru: API-ключ
zh_hans: API 密钥

source: sk-... (optional for local)
fr: sk-... (facultatif en local)
ja: sk-...（ローカルでは任意）
pt_br: sk-... (opcional para local)
ru: sk-... (для локального необязательно)
zh_hans: sk-...（本地可选）

source: Auth Header
fr: En-tête d'authentification
ja: 認証ヘッダー
pt_br: Cabeçalho de autenticação
ru: Заголовок авторизации
zh_hans: 认证头

source: Usage authentication
fr: Authentification de l'utilisation
ja: 使用量の認証
pt_br: Autenticação do uso
ru: Авторизация для расхода
zh_hans: 用量认证

source: API key
fr: Clé API
ja: API キー
pt_br: Chave de API
ru: API-ключ
zh_hans: API 密钥

source: Checking usage route...
fr: Vérification de la route d'utilisation…
ja: 使用量のルートを確認中…
pt_br: Verificando a rota de uso…
ru: Проверяем маршрут расхода…
zh_hans: 正在检查用量路径…

source: Retry detection
fr: Relancer la détection
ja: 検出をやり直す
pt_br: Detectar de novo
ru: Повторить определение
zh_hans: 重新检测

source: Usage URL: %@
fr: URL d'utilisation : %@
ja: 使用量 URL: %@
pt_br: URL de uso: %@
ru: URL расхода: %@
zh_hans: 用量 URL：%@

source: Test Connection & Fetch Models
fr: Tester la connexion et récupérer les modèles
ja: 接続をテストしてモデルを取得
pt_br: Testar conexão e buscar modelos
ru: Проверить связь и получить модели
zh_hans: 测试连接并获取模型

source: Model
fr: Modèle
ja: モデル
pt_br: Modelo
ru: Модель
zh_hans: 模型

source: Select a model...
fr: Choisir un modèle…
ja: モデルを選択…
pt_br: Selecione um modelo…
ru: Выберите модель…
zh_hans: 选择模型…

source: Model name (e.g. gpt-4o, llama-3.3)
fr: Nom du modèle (ex. gpt-4o, llama-3.3)
ja: モデル名（例: gpt-4o、llama-3.3）
pt_br: Nome do modelo (ex.: gpt-4o, llama-3.3)
ru: Название модели (например, gpt-4o, llama-3.3)
zh_hans: 模型名称（例如 gpt-4o、llama-3.3）

source: Appearance & Icon
fr: Apparence et icône
ja: 外観とアイコン
pt_br: Aparência e ícone
ru: Вид и значок
zh_hans: 外观与图标

source: Ring Accent
fr: Couleur de l'anneau
ja: リングのアクセント
pt_br: Destaque do anel
ru: Цвет кольца
zh_hans: 圆环强调色

source: Icon
fr: Icône
ja: アイコン
pt_br: Ícone
ru: Значок
zh_hans: 图标

source: Upload Custom Image...
fr: Importer une image…
ja: 画像をアップロード…
pt_br: Enviar imagem personalizada…
ru: Загрузить своё изображение…
zh_hans: 上传自定义图片…

source: Usage source
fr: Source d'utilisation
ja: 使用量のソース
pt_br: Fonte de uso
ru: Источник расхода
zh_hans: 用量来源

source: Manual
fr: Manuel
ja: 手動
ru: Вручную
zh_hans: 手动

source: JSON endpoint
fr: Point de terminaison JSON
ja: JSON エンドポイント
pt_br: Endpoint JSON
ru: JSON-эндпоинт
zh_hans: JSON 端点

source: Usage preset
fr: Préréglage d'utilisation
ja: 使用量のプリセット
pt_br: Predefinição de uso
ru: Пресет расхода
zh_hans: 用量预设

source: Custom JSON fields
fr: Champs JSON personnalisés
ja: カスタム JSON フィールド
pt_br: Campos JSON personalizados
ru: Свои поля JSON
zh_hans: 自定义 JSON 字段

source: No usage URL for this base URL
fr: Aucune URL d'utilisation pour cette URL de base
ja: このベース URL には使用量 URL がありません
pt_br: Não há URL de uso para esta URL base
ru: Для этого базового URL нет URL расхода
zh_hans: 这个基础 URL 没有用量 URL

source: LiteLLM key info may require a management credential; use Manual USD entry if unavailable.
fr: Les infos de clé LiteLLM peuvent exiger un identifiant d'administration ; utilisez la saisie manuelle en USD si elles sont indisponibles.
ja: LiteLLM のキー情報には管理用の認証情報が必要な場合があります。取得できない場合は USD を手動で入力してください。
pt_br: As informações de chave do LiteLLM podem exigir uma credencial de gerenciamento; use a entrada manual em USD se não estiverem disponíveis.
ru: Для данных о ключе LiteLLM может понадобиться управляющий ключ; если их нет, вводите сумму в USD вручную.
zh_hans: LiteLLM 的密钥信息可能需要管理凭证；拿不到时，请改用手动填写美元。

source: Requires --metrics on llama-server
fr: Nécessite --metrics sur llama-server
ja: llama-server で --metrics が必要です
pt_br: Requer --metrics no llama-server
ru: Нужен флаг --metrics у llama-server
zh_hans: 需要 llama-server 打开 --metrics

source: Import Custom JSON...
fr: Importer un JSON personnalisé…
ja: カスタム JSON を読み込む…
pt_br: Importar JSON personalizado…
ru: Импортировать свой JSON…
zh_hans: 导入自定义 JSON…

source: Save JSON template...
fr: Enregistrer un modèle JSON…
ja: JSON テンプレートを保存…
pt_br: Salvar modelo JSON…
ru: Сохранить шаблон JSON…
zh_hans: 保存 JSON 模板…

source: Usage URL
fr: URL d'utilisation
ja: 使用量 URL
pt_br: URL de uso
ru: URL расхода
zh_hans: 用量 URL

source: Records path
fr: Chemin des enregistrements
ja: レコードのパス
pt_br: Caminho dos registros
ru: Путь к записям
zh_hans: 记录路径

source: Model field
fr: Champ du modèle
ja: モデルのフィールド
pt_br: Campo do modelo
ru: Поле модели
zh_hans: 模型字段

source: Token field
fr: Champ des tokens
ja: トークンのフィールド
pt_br: Campo de tokens
ru: Поле токенов
zh_hans: Token 字段
